app/views/links/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 2]]
---
		<h3 class="comments_title">
		  <%= @link.comments.count %> Comments