app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "hop in "], ["url", "www.google.com"], ["created_at", 2017-02-11 02:18:56 UTC], ["updated_at", 2017-02-11 02:18:56 UTC], ["user_id", 2]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def upvote
    @link = Link.find(parmas[:id])